In [9]:
## Master 4: Baby names
## Description: Apply various function to a Baby names DF
## Language: Python
## Author: Alexander Hepburn
## Date: 23.04.2024

# Use jupyter notebook again
# we will use data set from kaggle on us-baby-names
# dataset is here:
# https://raw.githubusercontent.com/mslyon/testone/master/US_Baby_Names_right.csv
#Import the necessary libraries
import pandas as pd

In [10]:
# TASK 1: Assign it to a variable called baby_names
# Simple read using pd.read_csv()
baby_names = pd.read_csv("https://raw.githubusercontent.com/mslyon/testone/master/US_Baby_Names_right.csv")

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [11]:
# TASK 2: Check the info with .info()
# Get info with the info() function
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

In [12]:
# TASK 3: Check head with head()
# Get the first 5 entries with the head() function
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [14]:
# TASK 4: Delete the column 'Unnamed: 0' and 'Id'

del baby_names["Unnamed: 0"]
del baby_names["Id"]

In [25]:
# TASK 5: Group the dataset by name and assign to names
# use .groupby("Name").sum()

grouped_baby_names = baby_names.groupby("Name").sum() # Simple groupby and suming the Name
del grouped_baby_names["Gender"] # removing gender as it is not needed
del grouped_baby_names["Year"] # removing year as it is not needed
del grouped_baby_names["State"] # removing State as it is not needed
grouped_baby_names.head() # displaying the first 5

         Count
Name
Aaban       12
Aadan       23
Aadarsh      5
Aaden     3426
Aadhav       6

In [31]:

# TASK 6: sort from the biggest value to the smallest one / use .sort_values

sorted_group = grouped_baby_names.sort_values(by="Count") # sorting based on count

In [43]:
# TASK 7: as we have already grouped by the name, all the names are unique already. 
# get the length of names - use len

print("There are", len(grouped_baby_names), "unique baby names!") # printing the length of the names

There are 17632 unique baby names!

In [42]:
# TASK 8: What is the name with most occurrences?

most_occ_name = sorted_group.iloc[-1].name # Getting the last element for the most occcuring name
print(f"Name with the most occurences is: {most_occ_name}") # Printing the result

Name with the most occurences is: Jacob